performance_tests/artillery.yml
  config:
    target: "ws://localhost:4000/_rig/v1/connection/ws"
    # plugins:
    #   expect: {}
    processor: "./my-functions.js"
    phases:
      - duration: 300
        arrivalRate: 75
    ws:
      # Set a custom subprotocol:
      # subprotocols:
      #   - json
      #   - soap
  scenarios:
    - engine: "ws"
      flow:
        - function: "createTimestampedObject"
        #   expect:
        #     - equals:
        #         - "{{ data }}"
        #         - "connected"
        # - send: "hello"
        - think: 15
        # - send: "world"